{
    "added": "2015-09-30T02:45:07.269",
    "category": "PyCon ZA 2015",
    "copyright_text": "",
    "description": "When we think about scientific programming, we often focus on complex high-performance applications for performing simulations of chemical processes, or on data analysis tools. It is easy to overlook the gaps between tools, such as format conversions, which may be simple for a programmer to automate, but require hours of tedious work for a researcher without programming experience.\r\n\r\nIn this talk I will present a specific example of an application which fills such a gap in a medical research laboratory, where readings of chemical samples are used to measure the response of TB-causing bacteria to various drugs. The readings must be converted from the raw format produced by the instrument in the laboratory into a format suitable for uploading into an online tool for further analysis.\r\n\r\nI will also discuss more broadly how research institutions can improve efficiency by collaborating with programmers and by encouraging researchers to acquire basic programming skills.",
    "duration": 1771,
    "embed": "",
    "id": 3930,
    "language": "English",
    "quality_notes": "",
    "recorded": "2015-10-01",
    "related_urls": [],
    "slug": "a-little-scripting-goes-a-long-way-automating-da",
    "source_url": "http://youtu.be/6MlZOIryiwY",
    "speakers": [
        "Adrianna Pińska"
    ],
    "state": 1,
    "status": "published",
    "summary": "",
    "tags": [
        "Room 211"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/6MlZOIryiwY/hqdefault.jpg",
    "title": "A little scripting goes a long way: automating data processing in science",
    "updated": "2015-10-03T03:59:04.762",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": ""
}