{
    "added": "2015-09-30T02:46:10.644",
    "category": "PyCon ZA 2015",
    "copyright_text": "",
    "description": "In this talk, we will look at some real-world success stories using Kivy. From exhibition-size interactive displays to race car telemetry systems to robotics, Kivy is being used to deliver many compelling and innovative applications. We'll use these applications to discuss some of the features and abilities of the framework that make it such a good choice for a wide range of uses.\r\n\r\nWe'll briefly cover some exciting projects using Kivy, namely:\r\n\r\n* Project Liatris: a new, open source project using Kivy touch devices to control robots.\r\n\r\n* RaceCapture Pro: A race car telemetry system that uses Kivy interactive displays both in-car and in post-session analytics interaction.\r\n\r\n* Brain Trainer Plus: A mental dexterity trainer deployed to old age homes and medical treatment facilities that has been shown effective in treating dementia and other mental disorders, as well as bringing a greatly enhanced quality-of-life to the aged and mentally ill.\r\n  \r\n* CAMI Educational products: The rich feature set and effortless animation abilities of Kivy make developing compelling, responsive desktop and mobile interactions easy.\r\n    \r\n* The Icarus touch and Touch live projects: creating radically new and exciting interactive musical instruments.\r\n    \r\nAll of these applications are being delivered using Kivy, a free, open source, full stack, multi-touch, cross-platform Python/Cython framework that runs on a watch. I kid you not.",
    "duration": 3239,
    "embed": "",
    "id": 3936,
    "language": "English",
    "quality_notes": "",
    "recorded": "2015-10-02",
    "related_urls": [],
    "slug": "kivy-showcase-a-short-exploration-of-how-kivy-is",
    "source_url": "http://youtu.be/kXLQ_7GGMnM",
    "speakers": [
        "Richard Larkin"
    ],
    "state": 1,
    "summary": "",
    "tags": [
        "Room 215"
    ],
    "thumbnail_url": "https://i.ytimg.com/vi/kXLQ_7GGMnM/hqdefault.jpg",
    "title": "Kivy Showcase: a short exploration of how Kivy is changing the world",
    "updated": "2015-10-04T10:23:42.918",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": null,
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": ""
}