{
    "added": "2012-08-31T16:36:13",
    "category": "SciPy 2012",
    "copyright_text": "CC BY-SA",
    "description": "The National Oceanic and Atmospheric Administration's (NOAA) Hazardous Weather\nTestbed (HWT) is a facility jointly managed by NOAA's National Severe Storms\nLaboratory (NSSL), NOAA National Weather Service's (NWS) the Storm Prediction\nCenter (SPC), and the NOAA NWS Oklahoma City/Norman Weather Forecast Office\n(OUN) within the National Weather Center building on the University of\nOklahoma South Research Campus. The HWT is designed to accelerate the\ntransition of promising new meteorological insights and technologies into\nadvances in forecasting and warning for hazardous weather events throughout\nthe United States. The HWT facilities include a combined forecast and research\narea situated between the operations rooms of the SPC and OUN, and a nearby\ndevelopment laboratory. The facilities support enhanced collaboration between\nresearch scientists and operational weather forecasters on specific topics\nthat are of mutual interest.\n\nThe cornerstone of the HWT is the yearly Experimental Forecast Program (EFP)\nand Experimental Warning Program (EWP) which take place every spring. In each\nof those programs, forecasters, researchers, and developers come together to\nparticipate in a real-time operational forecasting or warning environment with\nthe purpose of testing and evaluating cutting-edge tools and methods for\nforecasting and warning. In the EFP program, between 5 and 10 TB of\nmeteorological data are processed for evaluation over the course of a 5 week\nperiod. These data come in a variety of sources, a variety of formats, each\nrequiring a different set of processing.\n\nThis talk will discuss how the data flow and data creation processes of the\nEFP are accomplished in a real-time setting through the use of Python. The\nutilization of Python ranges from simple shell scripting, to speeding up\nalgorithm development (and runtimes) with Numpy and Cython, to creating new,\nopen source data-visualization platforms, such as the Skew-T and Hodograph\nAnalysis and Research Program in Python, or SHARPpy.\n\n",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/7-rey41z2us?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/7-rey41z2us?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 1242,
    "language": "English",
    "quality_notes": "",
    "recorded": "2012-07-19",
    "related_urls": [],
    "slug": "utilizing-python-in-a-real-time-quasi-operationa",
    "source_url": "https://www.youtube.com/watch?v=7-rey41z2us",
    "speakers": [
        "Patrick Marsh"
    ],
    "state": 1,
    "summary": "",
    "tags": [
        "Meteorology Mini-Symposia"
    ],
    "thumbnail_url": "http://i4.ytimg.com/vi/7-rey41z2us/hqdefault.jpg",
    "title": "Utilizing Python in a Real-Time, Quasi-Operational Meteorological Environment",
    "updated": "2014-04-08T20:28:27.129",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "http://s3.us.archive.org/nextdayvideo/enthought/scipy_2012/Utilizing_Python_in_a_RealTime.mp4?Signature=6JVnu2cqjljXJd%2F8HbsSSvJfbdg%3D&Expires=1346383456&AWSAccessKeyId=FEWGReWX3QbNk0h3",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}