{
    "added": "2015-10-18T16:10:57.820",
    "category": "PyCon AU 2015",
    "copyright_text": "creativeCommon",
    "description": "Are you a scientist who's can't get work done because you the tools you need aren't available?  Do your collaborators use a different computing platform to you?  Are you struggling to find anyone who can help you solve your software integration problems?\r\n\r\nThese challenges occur because scientists face some of the most difficult challenges in computing  - dealing new and diverse problems;  working with prototypes and legacy systems; collaborating with domain experts, rather than software experts; all while delivering on time with minimal resources. \r\n\r\nPython has a reputation for being a language that excels at \"glueing\" different systems together in a style that is both easy to understand, test and maintain. More importantly using Python is one way to make sure that you spend your time working on research, rather than coding and debugging.\r\n\r\nThis presentation will demonstrate some of the skills needed to integrate software from other languages into the Python Scientific computing ecosystem using subprocesses, ctypes, cython the Jupyter project - and what do do when none of these approaches are the right.\r\n\n\n",
    "duration": null,
    "embed": "<iframe width=\"640\" height=\"360\" src=\"//www.youtube.com/embed/evhku1Lz8GE\" frameborder=\"0\" allowfullscreen></iframe>",
    "id": 3992,
    "language": "English",
    "quality_notes": "",
    "recorded": "2015-08-04",
    "related_urls": [],
    "slug": "not-invented-here-porting-scientific-software-to",
    "source_url": "https://www.youtube.com/watch?v=evhku1Lz8GE",
    "speakers": [
        "Andrew Walker"
    ],
    "state": 1,
    "summary": "",
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/evhku1Lz8GE/hqdefault.jpg",
    "title": "Not Invented Here: Porting Scientific Software to Python",
    "updated": "2015-10-18T16:10:57.820",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": null,
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": "needs editing"
}