{
    "added": "2015-10-18T16:10:58.240",
    "category": "PyCon AU 2015",
    "copyright_text": "creativeCommon",
    "description": "The workhorse plotting tool in Python for most of this century has been Matplotlib. It is stable, powerful, and comprehensive. But the plots it produces are (mostly) lifeless.\r\n\r\nThe web is now emerging as a superior visualization platform to traditional GUI backends, thanks to SVG, HTML5 Canvas, and WebGL, the speed and quality of modern browsers, and an explosion of high-quality visualization libraries in JavaScript. But what is the Python developer to do? Can we drive these browser-based capabilities from Python?\r\n\r\nThankfully, several recent Python projects are making progress toward this goal -- including MPLd3, Bokeh, and VisPy. These each have different goals and make different design decisions, but all three offer obvious advantages: being able to publish visualizations that users can interact with to extract more meaning from data.\r\n\r\nThis talk will give shiny demos and review these newer projects thoroughly vis-a-vis other libraries to help you decide whether, or when, to adopt one of them as your go-to visualization library. We will answer these questions: How does the performance compare? Would you need to rewrite all your plotting code? What would it take to integrate Bokeh or VisPy well with the current ecosystem of Python plotting libraries and data analysis tools? What is on the horizon for the different projects? Where do the Jupyter project's interactive widgets fit into this picture?\r\n\r\nCome to hear a critical review about the past, present, and future of interactive visualization in Python.\n\n",
    "duration": null,
    "embed": "<iframe width=\"640\" height=\"360\" src=\"//www.youtube.com/embed/kr85Jytwy0s\" frameborder=\"0\" allowfullscreen></iframe>",
    "id": 3995,
    "language": "English",
    "quality_notes": "",
    "recorded": "2015-08-04",
    "related_urls": [],
    "slug": "interactive-visualization-for-the-curious",
    "source_url": "https://www.youtube.com/watch?v=kr85Jytwy0s",
    "speakers": [
        "Edward Schofield"
    ],
    "state": 1,
    "status": "published",
    "summary": "",
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/kr85Jytwy0s/hqdefault.jpg",
    "title": "Interactive visualization for the curious",
    "updated": "2015-10-18T16:10:58.240",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": null,
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": "needs editing"
}