{
    "added": "2015-11-23T19:30:09.618",
    "category": "PyCon AU 2015",
    "copyright_text": "creativeCommon",
    "description": "This is teamwork and rapid prototyping challenges on steroids. Imagine 15 high school kids, most of whom have only just learned to program, working together to design and build a fully functional social networking site in 3 days. \r\n\r\nThis project is done as part of the NCSS (National Computer Science School) summer program. NCSS has been running for 20 years, and I've been involved in the last 7, so that's 6 different social networking sites (we used to build search engines, but apparently they're not cool anymore).\r\n\r\nI'll go through the technical details, the tools we use, how the site functions, and how we structure the different pieces to come together. I'll also show off some extra fun projects we throw at the advanced kids, like building their own Django-like template engine, and secure hashing of passwords.\r\n\r\nA lot of the challenge of this undertaking is inevitably also project management and coordination of the team. These students have never written tests before, don't know what version control is and don't understand what it means to agree on an API. Hilarity and frustration can (and does) ensue, especially during the last night, which is an all-nighter.\r\n\r\nCome along to learn how to do project management with the least experienced team possible and how to hack together a functional prototype webapp with minimum effort.",
    "duration": null,
    "embed": "<iframe width=\"640\" height=\"360\" src=\"//www.youtube.com/embed/gOnnjPQzXg8\" frameborder=\"0\" allowfullscreen></iframe>",
    "id": 4058,
    "language": "English",
    "quality_notes": "",
    "recorded": "2015-08-04",
    "related_urls": [],
    "slug": "rapid-prototyping-with-teenagers",
    "source_url": "https://www.youtube.com/watch?v=gOnnjPQzXg8",
    "speakers": [
        "Katie Bell"
    ],
    "state": 1,
    "summary": "",
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/gOnnjPQzXg8/hqdefault.jpg",
    "title": "Rapid prototyping with teenagers",
    "updated": "2015-11-23T19:35:30.083",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": "needs editing"
}