{
    "added": "2015-10-18T16:10:53.948",
    "category": "PyCon AU 2015",
    "copyright_text": "creativeCommon",
    "description": "The potential upside of microservices is significant and exciting. So much so that Yelp's Transaction Platform committed from the start to an architecture of small, cooperative microservices. This talk explores the inevitable complications that arise in successful projects based on microservices as they grow larger and stretch both their own architecture and the developers responsible for them. Come hear tales of terror (tight coupling! low test coverage!), stories which will warm your heart (agility! strong interfaces!), and everything in between as we follow the adventures of our plucky team.\r\n\r\nThe talk will be focused on the functional, cultural, and reliability challenges which occur as a microservices-based project evolves and expands over time. Particular attention will be paid to where these diverge from the utopian way microservices are often described, and to the practical approaches your project can take to mitigate issues and avoid the traps inherent in scaling up this type of approach. My goal is to share with attendees some mistakes we've made, some successful methods for growing gracefully, and above all with useful (and maybe unexpected!) lessons from the trenches they can apply to their own work.\n\n",
    "duration": null,
    "embed": "<iframe width=\"640\" height=\"360\" src=\"//www.youtube.com/embed/H0KReHUawHI\" frameborder=\"0\" allowfullscreen></iframe>",
    "id": 3964,
    "language": "English",
    "quality_notes": "",
    "recorded": "2015-08-04",
    "related_urls": [],
    "slug": "arrested-development",
    "source_url": "https://www.youtube.com/watch?v=H0KReHUawHI",
    "speakers": [
        "Scott Triglia"
    ],
    "state": 1,
    "summary": "",
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/H0KReHUawHI/hqdefault.jpg",
    "title": "Arrested Development",
    "updated": "2015-10-18T16:10:53.948",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": null,
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": "needs editing"
}