{"tags": [], "thumbnail_url": "https://i.ytimg.com/vi/mRSBNoPptPM/maxresdefault.jpg", "embed": "", "added": "2015-07-31T17:40:37.496", "whiteboard": "", "video_flv_length": null, "title": "How to manage over 1000contributors in a Python open source project", "duration": 1666, "description": "", "state": 1, "category": "PyCon FR 2013", "video_mp4_download_only": false, "video_flv_download_only": false, "video_mp4_url": null, "video_webm_length": null, "video_mp4_length": null, "recorded": "2013-11-30", "copyright_text": "", "source_url": "https://www.youtube.com/watch?v=mRSBNoPptPM", "video_webm_url": null, "summary": "Very large development: How to manage over 1000 contributors in a Python open source project\n\nIn this talk I want to present how the OpenStack project (one of the largest Open Source projects in Python) deals with QA, Peer Review and general quality control of the patch submissions. I will cover the tools, guidelines and best practice put in place to manage the complexity.\n\nOpenStack is a very large project with over 1.6 million lines of code, over 1000 active contributors and approximately 4000 commits per month. At least according to the latest stats from Ohloh.net. And this project is written (almost) completely in Python. This makes OpenStack one of the largest active open source projects written in this language.\n\nIn this presentation I will to talk about the challenges of large scale collaboration in Python projects and the solutions set up by the OpenStack community to address them. By studying the typical life cycle of a patch, I will present the tools involved in testing, peer review, continuous integration, as well as the tools enforcing community policies like style checking or maintaining compatibility across different Python versions.", "video_ogv_url": null, "video_ogv_length": null, "updated": "2015-07-31T17:40:37.496", "id": 3727, "related_urls": [], "slug": "how-to-manage-over-1000contributors-in-a-python-o", "quality_notes": "", "video_webm_download_only": false, "video_flv_url": null, "language": "French", "video_ogv_download_only": false, "speakers": ["Joe Hakim Rahme"]}