{
    "added": "2013-10-19T19:58:53",
    "category": "Kiwi PyCon 2013",
    "copyright_text": "",
    "description": "@ Kiwi PyCon 2013 - Sunday, 08 Sep 2013 - Track 1\r\n\r\n**Audience level**\r\n\r\nExperienced\r\n\r\n**Abstract**\r\n\r\nA decorator is any callable Python object that is used to modify a function, method or class definition. A decorator is passed the original object being defined and returns a modified object, which is then bound to the name in the definition.\r\n\r\nOne would generally expect the result of applying a decorator to an object to be another object which is not readily distinguishable from the original. Naive implementations of decorators do not however preserve introspectability. This can result in callable objects having different names, appearing to have different signatures or not returning the original doc strings. This can cause problems for tools where you want to derive information about the original wrapped object such as debuggers, IDEs, documentation systems or performance monitoring software.\r\n\r\nThe use of the functools.wraps() decorator addresses some of these issues, but relies on decorators being implemented as closures. Using a closure to implement a decorator will not always work when wrapping functions where the descriptor protocol needs to be triggered to bind a function to an instance, to create an instance method, or where the function is a special method type such as a class method or static method.\r\n\r\nA more robust decorator, and one where the decorator is able to distinguish when it is being applied to a normal function or instance method, needs to be implemented as a combination of a wrapper and a descriptor. To also be able to use this as a generic wrapper when performing monkey patching requires even more tricks.\r\n\r\nThe purpose of this talk is to walk through the various problems which arise with the more common ways of implementing decorators. It will then describe how to create a more robust generic wrapper/decorator which can be used in a wider range of scenarios than typical decorators.\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/graham-dumpleton-advanced-methods-for-creating-decorators",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/W7Rv-km3ZuA?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/W7Rv-km3ZuA?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2444,
    "language": "English",
    "quality_notes": "",
    "recorded": "2013-09-15",
    "related_urls": [],
    "slug": "advanced-methods-for-creating-decorators",
    "source_url": "http://www.youtube.com/watch?v=W7Rv-km3ZuA",
    "speakers": [
        "Graham Dumpleton"
    ],
    "state": 1,
    "summary": "Decorators are a simple concept, yet extremely powerful. Implementing decorators which will work in a range of contexts is however non trivial. This talk will walk through various problems which arise with the more common ways of implementing decorators and then describe how to combine a wrapper and a descriptor to build a better decorator.\r\n",
    "tags": [],
    "thumbnail_url": "http://i1.ytimg.com/vi/W7Rv-km3ZuA/hqdefault.jpg",
    "title": "Advanced methods for creating decorators",
    "updated": "2014-04-08T20:28:26.075",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}