{
    "added": "2013-07-10T12:02:45",
    "category": "PyCon AU 2013",
    "copyright_text": "CC-BY-SA",
    "description": "",
    "duration": 30,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/CSULRDoF8-g?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/CSULRDoF8-g?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2216,
    "language": "English",
    "quality_notes": "",
    "recorded": "2013-07-07",
    "related_urls": [],
    "slug": "getting-the-most-out-of-stack-overflow",
    "source_url": "https://www.youtube.com/watch?v=CSULRDoF8-g",
    "speakers": [
        "Adam Forsyth"
    ],
    "state": 1,
    "status": "published",
    "summary": "Stack Overflow is the single greatest repository of coding knowledge in the world. Now approaching five years old, its community-moderated, strict Q&A format has made it far more useful than other similar sites.\r\n\r\nContributing to it, however, can be intimidating. The questions of new users are often voted down or closed with little comment, or edited by the community in was the original poster doesn't understand. Answering is even worse. How do other people manage to post a detailed answer to a specific question in minutes, or even seconds? How could I possibly know so much about such a broad range of topics, even within a single programming language or framework?\r\n\r\nOver the past three years, I've learned a lot from contributing to Stack Overflow. It has honed my research, technical writing, and rapid prototyping skills, as well as greatly expanded my knowledge of the Python ecosystem, standard library, and CPython internals.\r\n\r\nI'll share not only how to use the site to learn, but also how to compete effectively with the thousands of other programmers who answer questions there on a daily basis -- we all like to win. I'll talk about what goes into a good answer, as well as a good question. I'll also talk about how contributing to Stack Overflow is like contributing to any other open source project in many ways -- in what you gain, as well as what the community gains, partly because of the CC-by-SA licensing used by the Stack Exchange network of sites.",
    "tags": [],
    "thumbnail_url": "http://i1.ytimg.com/vi/CSULRDoF8-g/hqdefault.jpg",
    "title": "Getting the most out of Stack Overflow",
    "updated": "2014-04-08T20:28:26.252",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": true,
    "video_mp4_length": null,
    "video_mp4_url": "http://s3.us.archive.org/ndvpyconau2013/Getting_the_most_out_of_Stack_.mp4",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": ""
}