{
    "added": "2013-07-13T01:04:13",
    "category": "PyCon AU 2013",
    "copyright_text": "CC-BY-SA",
    "description": "",
    "duration": 30,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/onYs20ykbBY?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/onYs20ykbBY?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2228,
    "language": "English",
    "quality_notes": "",
    "recorded": "2013-07-06",
    "related_urls": [],
    "slug": "scikit-learn-machine-learning-and-cybercrime-att",
    "source_url": "https://www.youtube.com/watch?v=onYs20ykbBY",
    "speakers": [
        "Robert Layton"
    ],
    "state": 1,
    "summary": "The scikit-learn library is a rapidly growing open source toolkit for machine learning in python. It allows for practitioners and researchers to apply machine learning in a variety of applications and is used by companies worldwide. Developed by programmers from around the world, the project has a large (and increasing) number of machine learning algorithms, a very useful set of utility functions and has also spawned a set of detailed tutorials. Written in python with the aid of numpy, scipy and cython, this library is featured, fast and extensible.\r\n\r\nIn this talk, I will introduce scikit-learn, giving an overview of the library, its features and how to use it for a number of different applications. Next talk about some of the tutorials that are actively being developed for learning machine learning and scikit-learn and also how to contribute. Through this, I'll introduce some key machine learning concepts and how you can apply them to a variety of tasks. The focus will be on practical uses, rather than theoretical advances.\r\n\r\nTo end the presentation, I'll briefly overview the research I perform at the Internet Commerce Security Laboratory (University of Ballarat) in cybercrime attribution, where I work with our industry partners to disrupt cybercrime. While it can be very difficult to do direct network based attribution, indirect methods through criminal profiling may assist in stopping crimes such as phishing or online fraud. I'll walk through some of our results in identifying the size and scope of the operations behind some of these attacks.",
    "tags": [],
    "thumbnail_url": "http://i1.ytimg.com/vi/onYs20ykbBY/hqdefault.jpg",
    "title": "scikit-learn, machine learning and cybercrime attribution",
    "updated": "2014-04-08T20:28:26.290",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": true,
    "video_mp4_length": null,
    "video_mp4_url": "http://s3.us.archive.org/ndvpyconau2013/scikitlearn_machine_learning_a.mp4",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": ""
}