{
    "added": "2012-09-06T22:33:19",
    "category": "EuroPython 2012",
    "copyright_text": "Standard YouTube License",
    "description": "Every application has its hotspots – small portions of code that consume\nconsiderably more resources than all of the other code combined. Django apps\nare no different. Some pages, invoked with the just the right, or wrong input,\ncan bring a server to its knees, hogging the CPU and taking many seconds, or\nin extreme cases even minutes to render. By keeping workers tied up, the whole\nsystem can then become slow to respond, or collapse altogether. Many\nwebservers have a crude built-in failsafe to prevent this. They automatically\nkill workers that fail to complete their requests in time. As a result, you\nmay not fully appreciate, or indeed realize at all that you are routinely\nserving 500 pages, denying users access to your service, or leaving\nuncommitted database transactions – possibly even slowly corrupting data.\nWorkers killed by force leave virtually no forensic traces and so even when\nissues are suspected, it’s hard to pin them down. The cause behind these\nhotspots can be poorly generated SQL queries from the ORM, an algorithm with\nnon-linear complexity, excessive disk or network IO, or lock contention in the\ndatabase – to name just a few. Oftentimes these problems escape a developer’s\nattention, as dev and test environments simply don’t have the dataset, level\nof concurrency or sheer size of the real thing. In this talk we’ll address the\nchallenges of tuning your Django app with continuous automatic runtime\ninspection tools, including homegrown Dogslow. We’ll uncover the pages that\nconsume disproportionate amounts of time and cycles to complete and the pages\nthat get killed altogether. We’ll discuss several ways to help you identify\nand eliminate the hotspots, both passively through monitoring exclusively, as\nwell as actively by selectively interrupting workers before they get killed\nand examine how to effectively interpret the automatically collected forensic\nevidence.\n\n",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/yxALwwDyWoA?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/yxALwwDyWoA?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 1304,
    "language": null,
    "quality_notes": "",
    "recorded": "2012-07-05",
    "related_urls": [],
    "slug": "healthy-webapps-through-continuous-introspection",
    "source_url": "http://www.youtube.com/watch?v=yxALwwDyWoA",
    "speakers": [
        "Nicolas Venegas"
    ],
    "state": 1,
    "summary": "[EuroPython 2012] Nicolas Venegas - 4 JULY 2012 in \"Track Spaghetti\"\n\n",
    "tags": [],
    "thumbnail_url": "http://i.ytimg.com/vi/yxALwwDyWoA/hqdefault.jpg",
    "title": "Healthy webapps through continuous introspection",
    "updated": "2014-04-08T20:28:27.244",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": null,
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": ""
}