{"tags": ["talk"], "thumbnail_url": "http://i.ytimg.com/vi/265Sqo7cgbM/hqdefault.jpg", "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/265Sqo7cgbM?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/265Sqo7cgbM?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>", "added": "2014-10-14T22:37:37.690", "whiteboard": "", "video_flv_length": null, "title": "The Full Monty - CI on OpenStack", "duration": 1800, "description": "= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\nDanny Adair:\r\nThe Full Monty - CI on OpenStack\r\n= = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = = \r\n@ Kiwi PyCon 2014 - Saturday, 13 Sep 2014 - Track 1 \r\nhttp://kiwi.pycon.org/\r\n\r\n**Audience level**\r\n\r\nIntermediate\r\n\r\n**Description**\r\n\r\nAre you continuously \"integrating\", or just running some unit tests inside a virtualenv?\r\n\r\nLet's go the Full Monty with OpenStack!\r\n\r\nProtagonists, in order of appearance: Gerrit, Jenkins, OpenStack, Puppet, Odoo (formerly OpenERP). Enjoy the ride!\r\n\r\n**Abstract**\r\n\r\nI'll show how we configured our CI tools to automatically build and destroy entire servers on OpenStack. We'll have Gerrit for code review, Jenkins for coordinating and monitoring the build process, OpenStack and its tools to build servers on their own subnet, Puppet for configuring said servers. The example project is an installation of Odoo (formely OpenERP) with a web server and PostgreSQL database.\r\n\r\nAt Catalyst, my team works with Odoo (formerly known as OpenERP), a modular Open Source suite of business applications. It has a very large and complex codebase and \"Regression\" is its middle name. It is under very active development on github, and customisations are generally brought in via plugins that override or extend default functionality. Basically, reasonable work on this requires continuous integration, it's not a luxury.\r\n\r\nWe could have a fat build server with multiple virtualenvs and multiple databases on the same PostgreSQL server, and just run some Python tests and be done with it. We could improve that with something like LXC, Vagrant etc. all happening on said build server. But why stop there - why not go all the way and create a more realistic setup? After all, another team is able to provide us with OpenStack. Let's go the Full Monty!\r\n\r\nLet's go hog wild and create and destroy entire servers just for the purpose of testing. Let's have separate application and database servers, just like in production.\r\n\r\nLet's also keep some servers alive for other purposes, e.g., user acceptance testing. Just sit in an IRC channel and after changes are committed for review, wait for a bot to post the URL of the newly built web server to click on. A nicely readable URL on a separate subdomain that is, of course!\r\n\r\nAs a bonus, I'll show how active upstream development on github fits into all this, and how your Ubuntu \"Precise Pangolin\" server can easily rehearse an upgrade to \"Trusty Tahr\".\r\n\r\n**Slides**\r\n\r\nhttps://speakerdeck.com/nzpug/danny-adair-the-full-monty-ci-on-openstack", "state": 1, "category": "Kiwi PyCon 2014", "video_mp4_download_only": false, "video_flv_download_only": false, "video_mp4_url": null, "video_webm_length": null, "video_mp4_length": null, "recorded": "2014-09-13", "copyright_text": "CC", "source_url": "http://youtu.be/265Sqo7cgbM", "video_webm_url": null, "summary": "", "video_ogv_url": null, "video_ogv_length": null, "updated": "2014-10-16T00:06:32.646", "id": 3229, "related_urls": [], "slug": "the-full-monty-ci-on-openstack", "quality_notes": "", "video_webm_download_only": false, "video_flv_url": null, "language": "English", "video_ogv_download_only": false, "speakers": ["Danny Adair"]}