{
    "added": "2014-07-31T00:46:25.903",
    "category": "EuroPython 2014",
    "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
    "description": "After half a lifetime \"undercover as a man\" I transitioned from male to female while staying involved in the Python community. This talk discusses that transition and explores how I found life in Python as a woman different from my former life as a man and the lessons about diversity I have learned.\r\n\r\nThis talk will include a brief discussion of what being transgender means, my experiences as I came to terms with it, and the losses and gains transition entailed. Early on I made the decision to be as open as possible and to stay engaged in the Python community as I transitioned and I will discuss why I made that decision and the levels of acceptance and support I encountered.\r\n\r\nTransition has been wonderfully successful, but that very transition put me in a surprisingly different world. Now being part of not one, but at least 3 groups that are minorities in the Python world gave me a very different view of a community I thought I knew, and pushed me to being an activist (or trouble maker) in spite of myself. In addition to the many positives the Python community has offered me on my journey, I will discuss the experiences that have made me understand that privilege is very much alive and well in the Python world.",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/CR0RwMHIzQ8?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/CR0RwMHIzQ8?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2956,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-07-24",
    "related_urls": [],
    "slug": "farewell-and-welcome-home-python-in-two-genders-0",
    "source_url": "http://www.youtube.com/watch?v=CR0RwMHIzQ8",
    "speakers": [
        "Naomi Ceder"
    ],
    "state": 1,
    "summary": "After half a lifetime I transitioned from male to female while staying involved in the Python community. This talk discusses that transition and explores how I found life in Python as a woman different from my former life as a man and the lessons about diversity I have learned.",
    "tags": [],
    "thumbnail_url": "http://i.ytimg.com/vi/CR0RwMHIzQ8/hqdefault.jpg",
    "title": "Farewell and Welcome Home: Python in Two Genders",
    "updated": "2014-07-31T01:23:44.404",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}