{
    "added": "2014-08-06T18:53:20.994",
    "category": "PyData Berlin 2014",
    "copyright_text": "http://creativecommons.org/licenses/by/3.0/",
    "description": "Tim Berners-Lee defined the Semantic Web as a web of data that can be processed directly and indirectly by machines. More precisely, the Semantic Web can be defined as a set of standards and best practices for sharing data and the semantics of that data over the Web to be used by applications [DuCharme, 2013].\r\n\r\nIn particular, the Semantic Web is built on top of three main pillars: the RDF (i.e., Resource Description Framework) data model, the SPARQL query language, and the OWL standard for storing vocabularies and ontologies. These standards allows the huge amount of data on the Web to be available in a unique and unified standard format, contributing to the definition of the Web of Data (WoD) [1].\r\n\r\nThe WoD makes the web data to be reachable and easily manageable by Semantic Web tools, providing also the relationships among these data (thus practically setting up the “Web”). This collection of interrelated datasets on the Web can also be referred to as Linked Data [1].\r\n\r\nTwo typical examples of large Linked Dataset are FreeBase, and DBPedia, which essentially provides the so called Common sense Knowledge in RDF format. Python offers a very powerful and easy to use library to work with Linked Data: rdflib. RDFLib is a lightweight and functionally complete RDF library, allowing applications to access, create and manage RDF graphs in a very Pythonic fashion.\r\n\r\nIn this talk, a general overview of the main features provided by the rdflib package will be presented. To this end, several code examples will be discussed, along with a case study concerning the analysis of a (semantic) social graph. This case study will be focused on the integration between the networkx module and the rdflib library in order to crawl, access (via SPARQL), and analyze a Social Linked Data Graph represented using the FOAF (Friend of a Friend) schema.\r\n\r\nThis talk is intended for an Novice level audience, assuming a good knowledge of the Python language.",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/5DCS9LE-8rE?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/5DCS9LE-8rE?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 3076,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-07-26",
    "related_urls": [
        {
            "description": "Slides",
            "url": "https://speakerdeck.com/valeriomaggio/mastering-linked-data-with-ptyhon"
        },
        {
            "description": "NetworkX",
            "url": "http://networkx.github.io/"
        },
        {
            "description": "RDFLib",
            "url": "https://github.com/RDFLib/rdflib"
        }
    ],
    "slug": "semantic-python-mastering-linked-data-with-pytho",
    "source_url": "http://www.youtube.com/watch?v=5DCS9LE-8rE",
    "speakers": [
        "Valerio Maggio"
    ],
    "state": 1,
    "status": "published",
    "summary": "",
    "tags": [],
    "thumbnail_url": "http://i.ytimg.com/vi/5DCS9LE-8rE/hqdefault.jpg",
    "title": "Semantic Python: Mastering Linked Data with Python",
    "updated": "2014-08-06T20:44:11.251",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "http://video.ep14.c3voc.de/20244.mp4",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}