{
    "added": "2012-10-08T17:39:53",
    "category": "DjangoCon 2012",
    "copyright_text": "Creative Commons Attribution license (reuse allowed",
    "description": "PCI DSS is a set of twelve different security standards that are required for\nany organization that handles credit or debit card transactions. These\nstandards are created by the Payment Card Industry Security Standards Council\nand they require all organizations to validate that they are compliant every\nyear.\n\nUnderstanding these rules and how they effect you is sometimes a daunting\ntask. The goals of this talk will be the following:\n\n  * Explain PCI DSS, and quickly go over the rules that will effect your application.\n  * Show how to securely handle credit card transactions in your Django application.\n  * Storing credit card information isn't ideal, but if you need to, I'll explain the different ways to securely store the data.\n  * Go over the different ways to limit your PCI DSS liability (BrianTree, Akamai Edge Tokenization, Auth.net CIM)\n  * Explore the different tools you will need in order validate your PCI compliance (Web application scans, IDS, Network Scan, firewalls)\n  * How to be PCI Complaint in the cloud\n\nI'll close out the talk with some of the details on how I haver personally\nsatisfied PCI DSS Requirements on my projects in the past. I'll cover some of\nthe tools and services that I used, and why I decided to use them.\n\nAt the conclusion of the talk you should have a better understanding of PCI\nDSS, and what you need to do, in order for your Django application to be\ncertified as compliant.\n\n",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/9ZIPNWqjIEI?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/9ZIPNWqjIEI?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 1411,
    "language": "English",
    "quality_notes": "",
    "recorded": "2012-09-06",
    "related_urls": [],
    "slug": "building-pci-compliant-django-applications",
    "source_url": "http://www.youtube.com/watch?v=9ZIPNWqjIEI",
    "speakers": [
        "Ken Cochrane"
    ],
    "state": 1,
    "summary": "If you currently accept credit cards with your Django application today, or\nyou plan on accepting them in the future, then you will need to worry about\nPCI DSS. Learn what you need to do to make sure that your application is PCI\nDSS compliant, and if it is not, what you need to do to bring it into\ncompliance.\n\n",
    "tags": [
        "django",
        "pci-complicance"
    ],
    "thumbnail_url": "http://i.ytimg.com/vi/9ZIPNWqjIEI/hqdefault.jpg",
    "title": "Building PCI compliant Django applications",
    "updated": "2014-04-08T20:28:26.972",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": null,
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": "needs editing"
}