{
    "added": "2014-07-19T22:16:55.067",
    "category": "SciPy 2014",
    "copyright_text": "http://www.youtube.com/t/terms",
    "description": "This tutorial is targeted to those who are or soon will be teaching numerical methods or scientific computing and are interested in using Python as the programming language for their course.  The tutorial will be useful both to academics teaching university courses and those in industry who run training sessions.  No prior knowledge of the IPython notebook is necessary, but participants should have some familiarity with Python, Numpy, and Matplotlib.\r\n\r\nIPython notebooks are an excellent medium for teaching nuemrical methods since they can include both mathematical explanations and executable code in a single document.  The tutorial will begin with an introduction to the IPython notebook, emphasizing how to overcome aspects that can be confusing to students.  Next we will go over available free resources for \r\n\r\n- ensuring that students have a suitable computing environment, using either a cloud platform or a packaged distribution\r\n- distributing and collecting notebooks\r\n- converting notebooks to other formats that may be useful in a course\r\n\r\nWe will also review a number of excellent existing resources containing IPython notebooks for numerical methods courses.  Using these notebooks as examples, we will discuss how to design effective notebooks for teaching, including\r\n\r\n- typesetting mathematical equations and expressions using LaTeX\r\n- Formatting, referencing, and layout using Markdown\r\n- inserting complete or partial code snippets\r\n- embedding figures and other media\r\n- embedding interactive widgets\r\n\r\nWe will briefly discuss different approaches to using IPython notebooks in a course, including their use as the basis for\r\n\r\n- homework assignments\r\n- short activities during a class session\r\n- longer laboratory sessions\r\n\r\nFinally, participants will be asked to develop, individually or in small groups, a notebook of their own that could be used as an assignment, classroom exercise, or lecture.",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/L-caFdJMR9E?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/L-caFdJMR9E?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2860,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-07-09",
    "related_urls": [],
    "slug": "teaching-numerical-methods-part-1",
    "source_url": "http://www.youtube.com/watch?v=L-caFdJMR9E",
    "speakers": [
        "Aron Ahmadia",
        "David I. Ketcheson"
    ],
    "state": 1,
    "summary": "This tutorial will give participants an introduction to the use of IPython notebooks in teaching numerical methods or scientific computing, at the level of an undergraduate or graduate university course.  Prior familiarity with notebooks is not necessary.  Participants will create an interactive notebook that explains and helps students to implement and explore a numerical algorithm.",
    "tags": [
        "ipython",
        "numerical methods"
    ],
    "thumbnail_url": "http://i1.ytimg.com/vi/L-caFdJMR9E/hqdefault.jpg",
    "title": "Teaching Numerical Methods with IPython Notebooks, Part 1",
    "updated": "2014-07-19T22:21:53.093",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}