{
    "added": "2014-07-15T22:45:40.036",
    "category": "SciPy 2014",
    "copyright_text": "http://www.youtube.com/t/terms",
    "description": "The surge in mobile device adoption and the subsequent abundance of time-stamped location data have given rise to possibilities and interest in understanding movement-based human behavior. The PlaceIQ analytic platform is a large-scale data analysis system that addresses this demand, providing a large-scale, flexible, and reliable platform created around the concepts of location and audience. The platform's data processing piece ingests large volumes of mobile activity data daily and overlays them onto geospatial data. These data include: the discretization of the U.S. into 1 billion 100 meter by 100 m tiles; more than 400,000 proprietary polygons delineating the shapes of properties and businesses; business listings and census data; and terabytes of mobile activity data. We discuss here the methodologies - namely DBSCAN clustering and kd-trees - used to de-dupe disparate geodata sources and evaluate the quality of noisy activity data at scale. The resulting overlays of people, places, and time create high-fidelity abstractions and manipulations insightful to businesses, particularly in the mobile advertising domain.\r\n",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/ygI1LP_jD9A?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/ygI1LP_jD9A?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2791,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-07-13",
    "related_urls": [],
    "slug": "the-placeiq-location-based-analytic-platform",
    "source_url": "http://www.youtube.com/watch?v=ygI1LP_jD9A",
    "speakers": [
        "Eliza Chang"
    ],
    "state": 1,
    "status": "published",
    "summary": "PlaceIQ's patented platform analyzes half a trillion diverse data points about location, time, and real-world behavior to define human audiences and allow businesses to understand consumers at scale. It ingests large volumes of mobile activity data and geographic data, calling for creative use machine learning techniques to enable the high-fidelity abstractions insightful to businesses.",
    "tags": [],
    "thumbnail_url": "http://i1.ytimg.com/vi/ygI1LP_jD9A/hqdefault.jpg",
    "title": "The PlaceIQ Location Based Analytic Platform",
    "updated": "2014-07-16T14:30:53.555",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}