{
    "added": "2014-07-09T19:24:54.907",
    "category": "SciPy 2014",
    "copyright_text": "http://www.youtube.com/t/terms",
    "description": "Computational and mathematical models can yield profound insights in the study of the spread of infectious diseases, illustrating difficult concepts such as herd immunity, suggesting new avenues for empirical research, and obtaining repeatable, quantifiable evidence in situations where other study designs are difficult if not impossible.\r\n\r\nTeaching infectious disease modeling presents a challenge however, as it requires the development of three unrelated skill sets: the theory of infectious disease models, subject-matter expertise about the diseases themselves, and the programming skills needed to implement all but the simplest models.\r\n\r\nRather than forcing these skill sets to be developed in parallel, *Zeke* is an educational platform meant to allow students to develop these skills in sequence. It uses a zombie epidemic to remove the need for specific expertise regarding disease systems, relying instead on a familiar cultural reference. Students are allowed to first explore the theory of modeling, a Django front-end enabling interaction with models without the need for scientific computing skills. All the models are however implemented to be stand-alone models that can be run using SciPy or other packages, and as students grow in sophistication the open-source nature of *Zeke* allows them to develop both computational and subject-specific expertise in a stepwise fashion.",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/bZv9Rw6Nh8M?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/bZv9Rw6Nh8M?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2728,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-07-09",
    "related_urls": [],
    "slug": "zeke-a-python-platform-for-teaching-mathematical",
    "source_url": "http://www.youtube.com/watch?v=bZv9Rw6Nh8M",
    "speakers": [
        "Eric Lofgren"
    ],
    "state": 1,
    "summary": "Zeke is an educational platform implemented using Python, SciPy and Django which allows students and researchers interested in the modeling of infectious diseases to learn both modeling and scientific computing skills in an interactive environment, without forcing theoretical and computational skills to be developed simultaneously.",
    "tags": [
        "education"
    ],
    "thumbnail_url": "http://i1.ytimg.com/vi/bZv9Rw6Nh8M/hqdefault.jpg",
    "title": "Zeke: A Python Platform for Teaching Mathematical Modeling of Infectious Diseases",
    "updated": "2014-07-09T19:24:54.907",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": null,
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": ""
}