{
    "added": "2014-07-15T22:45:43.062",
    "category": "SciPy 2014",
    "copyright_text": "http://www.youtube.com/t/terms",
    "description": "In 2013, the Gordon and Betty Moore and the Alfred P. Sloan foundations [awarded](http://www.moore.org/programs/science/data-driven-discovery/data-science-environments) UC Berkeley, U. Washington and NYU for a collaborative, $38M in support of a 5-year initiative to create novel environments for Data Science.  This project was driven by the recognition that computing and data analysis have now become the backbone of all scientific research, and yet the teams, collaborations and individuals that make this possible typically encounter significant barriers in today's academic environments.\r\n\r\nThe SciPy community is one of the poster children of this issue: many of our members live \"officially\" in traditional, discipline-oriented scientific research, and yet we have committed time and effort to creating an open ecosystem of tools for research.  As we all know, this is often done with little support from the standard incentive structures of science, be it publication venues, funding agencies or hiring, tenure and promotion committees.\r\n\r\nThe launch of this initiative is an important moment, as it signals the recognition of this problem by important and well-respected foundations in science.  At UC Berkeley, we took this opportunity to create the new [Berkeley Institute for Data Science](http://vcresearch.berkeley.edu/datascience/bids-launch-dec-12). In this effort, the open source tools of the SciPy community will play a central role.\r\n\r\nIn this talk, I will describe the larger context in which this initiative has been created, as well as the scientific scope of our team, our goals, and the opportunities that we will try to provide with this space.  We expect that this new institute, together with our partners at UW and NYU, will play an important role in support of the great work of the SciPy ecosystem.\r\n",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/q5yAy4WWTyU?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/q5yAy4WWTyU?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2820,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-07-10",
    "related_urls": [],
    "slug": "the-berkeley-institute-for-data-science-a-place-f",
    "source_url": "http://www.youtube.com/watch?v=q5yAy4WWTyU",
    "speakers": [
        "Fernando Pérez"
    ],
    "state": 1,
    "status": "published",
    "summary": "I will describe the new Berkeley Institute for Data Science (BIDS), part of a collaboration with UW and NYU funded by the Moore and Sloan Foundations. It will be a space for the open and interdisciplinary work that is typical of the SciPy community.  In the creation of BIDS, the role of open source scientific tools for Data Science, and specifically the SciPy ecosystem, played an important role.",
    "tags": [],
    "thumbnail_url": "http://i1.ytimg.com/vi/q5yAy4WWTyU/hqdefault.jpg",
    "title": "The Berkeley Institute for Data Science a place for people like us",
    "updated": "2014-10-26T16:27:52.648",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}