{"tags": [], "thumbnail_url": "http://i1.ytimg.com/vi/VDWXJQggFH8/hqdefault.jpg", "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/VDWXJQggFH8?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/VDWXJQggFH8?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>", "added": "2014-07-15T22:45:37.739", "whiteboard": "", "video_flv_length": null, "title": "Software for Panoptes: A Citizen Science Observatory", "duration": null, "description": "The goal of Project Panoptes (Panoptic Astronomical Networked OPtical observatory for Transiting Exoplanets Survey, see http://projectpanoptes.org/) is to build low cost, reliable, robotic telescopes which can be used to detect transiting exoplanets.  The hardware is designed to be standardized, using as many commercial off the shelf components as possible so that a Panoptes \"unit\" can be reproduced quickly and easily by students or amateurs.  In this way, many units can be deployed at many different sites to provide continuous and redundant sky coverage.  Panoptes is designed from the ground up to be a citizen science project which will involve the public in all aspects of the science, from data acquisition to data reduction.\r\n\r\nIn this presentation, we describe the current status of the Panoptes Observatory Control System (POCS, see https://github.com/panoptes/POCS), an open source, collaborative, python-based software package.  POCS is designed to be a simple as possible in order to make it accessible to non-experts.  As such, POCS is a state machine which transitions between a few well defined operating states.  We make extensive use of existing modules (notably astropy and pyephem).  The challenge we face in writing POCS to to balance our desire for simplicity and accessibility against capability.\r\n\r\nWe will also briefly describe the other software challenges of our project, specifically an algorithm designed to extract accurate photometry from DSLR images (color images obtained using a Bayer color filter array) rather than from the more traditional filtered monochrome CCD image.\r\n", "state": 1, "category": "SciPy 2014", "video_mp4_download_only": false, "video_flv_download_only": false, "video_mp4_url": "", "video_webm_length": null, "video_mp4_length": null, "recorded": "2014-07-14", "copyright_text": "http://www.youtube.com/t/terms", "source_url": "http://www.youtube.com/watch?v=VDWXJQggFH8", "video_webm_url": "", "summary": "In this presentation, we describe the current status of software for Project Panoptes.  Our goal is to build low cost, reliable, robotic telescopes which can be used to detect transiting exoplanets.  Panoptes is designed from the ground up to be a citizen science project which will involve the public in all aspects of the science, from data acquisition to data reduction.", "video_ogv_url": "", "video_ogv_length": null, "updated": "2014-07-15T23:17:30.674", "id": 2776, "related_urls": [], "slug": "software-for-panoptes-a-citizen-science-observat", "quality_notes": "", "video_webm_download_only": false, "video_flv_url": "", "language": "English", "video_ogv_download_only": false, "speakers": ["Josh Walawender", "Michael Butterfield"]}