{"tags": [], "thumbnail_url": "http://i1.ytimg.com/vi/bITvUUyvUAY/hqdefault.jpg", "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/bITvUUyvUAY?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/bITvUUyvUAY?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>", "added": "2014-07-15T22:45:41.984", "whiteboard": "", "video_flv_length": null, "title": "Zero Dependency Python", "duration": null, "description": "We present a new method for distributing and using Python that requires no\r\ndependencies beyond the Google Chrome web browser.  By combining the static\r\nlinking methodology of traditional supercomputer-style deployments of Python\r\nwith the technology Portable Native Client (PNaCl) we have constructed a method\r\nfor building, deploying, and sharing fully-sandboxed scientific python stacks\r\nthat require no client-side installation: the entire IPython notebook and\r\nscientific python stack, in a website, at native speeds.  We will present this\r\ntechnology, along with some of its potential applications, describing its\r\nshortcomings and future extensibility.  We will conclude by demonstrating an\r\nIPython notebook run completely client side with no out-of-browser components,\r\nbacked by Google Drive and an HTML5 File System, and able to pass numpy arrays\r\nas typed arrays into the browser without serialization as JSON.\r\n\r\n1. We will begin by briefly describing the problems with deploying scientific python\r\nas a stack, particularly the dependency graph, installation time, and so\r\non.\r\n\r\n2. We'll describe the PNaCl technology and build system for\r\nscientific python, including how individuals can create their own .pexes with\r\ntheir own application stack\r\n\r\n3. We'll describe potential applications,\r\nsuch as bundling safe, sandboxed executables with scripts and lessons\r\n\r\n4. We will demonstrate a complete system for running the IPython notebook in a\r\nsandboxed, Google Chrome window\r\n\r\n5. We'll conclude by describing methods that this system could be extended to run sandboxed python executables on any\r\nsystem, independent of the Chrome web browser, such as supercomputers and\r\nnon-virtualized hosting providers\r\n", "state": 1, "category": "SciPy 2014", "video_mp4_download_only": false, "video_flv_download_only": false, "video_mp4_url": "", "video_webm_length": null, "video_mp4_length": null, "recorded": "2014-07-10", "copyright_text": "http://www.youtube.com/t/terms", "source_url": "http://www.youtube.com/watch?v=bITvUUyvUAY", "video_webm_url": "", "summary": "We present a new method for distributing and using Python that requires no dependencies beyond the Google Chrome web browser based on Portable Native Client (PNaCl).  We will demonstrate an IPython notebook run completely client side with no out-of-browser components, backed by Google Drive, an HTML5 File System, and able to pass numpy arrays as typed arrays without serialization as JSON.", "video_ogv_url": "", "video_ogv_length": null, "updated": "2014-07-15T23:14:39.287", "id": 2810, "related_urls": [], "slug": "zero-dependency-python", "quality_notes": "", "video_webm_download_only": false, "video_flv_url": "", "language": "English", "video_ogv_download_only": false, "speakers": ["Kester Tong", "Matthew Turk"]}