{
    "added": "2014-07-15T22:45:38.721",
    "category": "SciPy 2014",
    "copyright_text": "http://www.youtube.com/t/terms",
    "description": "The practice of representing geospatial data upon a flat surface is known as\r\ncartography, and the topological implications of projecting fundamentally 3D\r\ndata onto a 2 dimensional surface has been the challenge of map-makers since\r\ntime immemorial. Geospatial visualisation software is often implemented without\r\nconsideration for the 3rd dimension and this commonly results in problems\r\naround the dateline or at the poles. For small areas these problems are often\r\nnot apparent and mostly surmountable, but at a global scale, such as when\r\nvisualising output from GCMs (General circulation models), the underlying\r\nrepresentation must be addressed head-on in order to visualise the data\r\n\"impact free\".\r\n\r\nCartopy is a Python package which builds on top of\r\nProj.4 to define coordinate reference systems for the transformation and\r\nvisualisation of geospatial data. As well as the fundamental transformations\r\nthere is also a matplotlib interface allowing easy generation of maps with the\r\nsame publication quiality expected of matplotlib. Cartopy employs several\r\ntechniques to handle geospatial data correctly, including true spherical\r\ninterpolation for raster data, and Shapely geometry interpolate-and-cut\r\ntransformations for geospatial vector data.\r\n\r\nThis talk will outline some\r\nof the capabilities of cartopy, and continue onto its practical application\r\nwithin the realm of scientific presentation of geospatial data.\r\n",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/Ax75kA4_kRo?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/Ax75kA4_kRo?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2782,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-07-14",
    "related_urls": [],
    "slug": "cartopy",
    "source_url": "http://www.youtube.com/watch?v=Ax75kA4_kRo",
    "speakers": [
        "Richard Hattersley"
    ],
    "state": 1,
    "status": "published",
    "summary": "Cartopy is a Python package which builds on Proj.4 to define coordinate reference systems for the transformation and visualisation of geospatial data. It has a simple matplotlib interface for publication quality visualisation. This talk will outline some of cartopy's functionality and demonstrate some practical applications within the realm of scientific presentation of geospatial data.",
    "tags": [],
    "thumbnail_url": "http://i1.ytimg.com/vi/Ax75kA4_kRo/hqdefault.jpg",
    "title": "Cartopy",
    "updated": "2014-07-15T22:56:35.894",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}