{
    "added": "2014-07-15T22:45:39.683",
    "category": "SciPy 2014",
    "copyright_text": "http://www.youtube.com/t/terms",
    "description": "Remote sensing data is complicated, very complicated! It is not only geospatially tricky but also indirect as the sensor measures the interaction of the media with the probing radiation, not the geophysics. However the problem is made tractable by the large number of algorithms available in the Scientific Python community, what is needed is a common data model for active remote sensing data that can act as a layer between highly specialized file formats and the cloud of scientific software in Python. This presentation motivates this work by asking: How big is a rainshaft? What is the natural dimensionality of rainfall patterns and how well is this represented in fine scale atmospheric models. Rather than being specific to the domain of meteorology we will break down how we approach this problem in terms what tools across numerous packages we used to read, correct, map and reduce the data to forms able to answer our science questions. This is a \"how\" presentation, covering signal processing using linear programming methods, mapping using KD Trees, and image analysis using ndimage and, of course graphics using Matplotlib.\r\n",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/1D0aTToHrCY?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/1D0aTToHrCY?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2788,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-07-13",
    "related_urls": [],
    "slug": "measuring-rainshafts-bringing-python-to-bear-on",
    "source_url": "http://www.youtube.com/watch?v=1D0aTToHrCY",
    "speakers": [
        "Scott Collis"
    ],
    "state": 1,
    "summary": "This presentation details how Python is being used to extract geophysical insight from active remote sensing data, namely Radars. By using a common data model our work bridges the gap between the domains of radar engineering and image analysis.",
    "tags": [],
    "thumbnail_url": "http://i1.ytimg.com/vi/1D0aTToHrCY/hqdefault.jpg",
    "title": "Measuring Rainshafts: Bringing Python to Bear on Remote Sensing Data",
    "updated": "2014-07-16T14:11:40.987",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}