{
    "added": "2014-07-15T22:45:41.881",
    "category": "SciPy 2014",
    "copyright_text": "http://www.youtube.com/t/terms",
    "description": "### Background/Motivation\r\n\r\nThe Scientific Python community's contributions to greater scientific understanding have been underappreciated by academic institutions. One reason for this is that software engineering is widely misunderstood and not recognized as research work in its own right, as opposed to paper publication and patents. A better understanding of the open source software development process itself will help academic institutions recognize the contributions of open source developers.\r\n\r\n\r\n### Methods\r\n\r\nI collect historical data from development of Scientific Python projects and render these into formats suitable for analysis using SciPy tools. To demonstrate the potential of this work, I will show two ways of analyzing this data scientifically: as a self-excited Hawkes process exibiting shock behavior, and as information diffusion over a social network.\r\n\r\n### Results\r\n\r\nThe purpose of this talk is twofold.\r\n\r\nFirst, to introduce tools and techniques for turning data from open source software production into scientific data suitable for analysis.  This talk proposes that there's an opportunity for SciPy to engage in _reflexive data science_, using its own data to learn more about how it functions and how to operate more efficiently.\r\n\r\nSecond, this talk will present visualizations of the data based on complex systems research and social network analysis. Building on prior work, these results will focus on the role of productive bursts in communications. Drawing on social network analysis and prior work on roles in Usenet communities and open source communities, this talk will provide historical insight into the interaction between SciPy communities.\r\n",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/IL9KqJtTGw0?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/IL9KqJtTGw0?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2809,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-07-13",
    "related_urls": [],
    "slug": "reflexive-data-science-on-scipy-communities",
    "source_url": "http://www.youtube.com/watch?v=IL9KqJtTGw0",
    "speakers": [
        "Sebastian Benthall"
    ],
    "state": 1,
    "summary": "I present tools for collecting data generated by Scientific Python community development infrastructure (mailing list archives, pull requests, issue trackers) and analyzing it with Pandas and NetworkX. Showing preliminery results using social network analysis and complex systems modeling, I demonstrate using reflexive data science to enrich our understanding of open source development.",
    "tags": [],
    "thumbnail_url": "http://i1.ytimg.com/vi/IL9KqJtTGw0/hqdefault.jpg",
    "title": "Reflexive Data Science on SciPy Communities",
    "updated": "2014-07-16T14:25:10.436",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}