{
    "added": "2014-07-09T19:24:52.816",
    "category": "SciPy 2014",
    "copyright_text": "http://www.youtube.com/t/terms",
    "description": "Astronomical data (whether images on the sky, or other data) are typically stored with information about their corresponding projection (Gnomonic, Mercator, Conical, Aitoff, and *many* more) and coordinate system (Equatorial, Galactic, Ecliptic, and so on).\r\n\r\nI will present [WCSAxes](https://github.com/astrofrog/wcsaxes \"WCSAxes\"), a new framework for plotting such astronomical data, developed as part of the [Astropy](http://www.astropy.org) project. WCSAxes consists primarily of a [Matplotlib](http://www.matplotlib.org \"Matplotlib\") Axes sub-class that seamlessly handles the plotting of ticks, tick labels, and grid lines for arbitrary coordinate systems and projections.\r\n\r\nAs an example, the following plot was produced with WCSAxes:\r\n\r\n![The Galactic Center as seen by Chandra](http://www.mpia.de/~robitaille/chandra_avm_small.png \"The Galactic center as seen by the Chandra X-ray observatory\")\r\n\r\n(Image Credit: NASA/CXC/UMass/D. Wang et al. - [http://chandra.harvard.edu/photo/2009/gcenter/](http://chandra.harvard.edu/photo/2009/gcenter/))\r\n\r\nSince it is a sub-class of the Matplotlib Axes class, all the default Matplotlib methods such as plot, scatter, imshow, contour, as well as patches, lines, collections, and so on are supported, and WCSAxes - in combination with Matplotlib's ability to accept arbitrary transformations - makes it very easy to define whether the plotting should apply to pixel coordinates, or a world coordinate system related to the data.\r\n\r\nWCSAxes has been designed as a framework that can be easily used in other Python tools, and it is planned for inclusion in [Glue](http://www.glueviz.org), [APLpy](http://aplpy.github.io), and other astronomical tools. While originally written for Astronomical images, it should be easily extendable to any kind of map (such as Earth-based geospatial data) provided that the projection and coordinate system can be represented by a pixel-to-world transformation.",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/ukR5a2TJJt4?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/ukR5a2TJJt4?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2723,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-07-09",
    "related_urls": [],
    "slug": "wcsaxes-a-framework-for-plotting-astronomical-an",
    "source_url": "http://www.youtube.com/watch?v=ukR5a2TJJt4",
    "speakers": [
        "Thomas Robitaille"
    ],
    "state": 1,
    "summary": "I will present WCSAxes, a new framework for plotting astronomical data that seamlessly handles the plotting of ticks, tick labels, and grid lines for arbitrary coordinate systems and projections. While originally written for with astronomical data, it can be used for any kind of map provided that the projection and coordinate system can be represented by a pixel-to-world transformation.",
    "tags": [
        "astronomy",
        "gis"
    ],
    "thumbnail_url": "http://i1.ytimg.com/vi/ukR5a2TJJt4/hqdefault.jpg",
    "title": "WCSAxes: A Framework for Plotting Astronomical and Geospatial Data",
    "updated": "2014-07-14T14:06:51.100",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}