{
    "added": "2015-06-14T17:04:24.606",
    "category": "PyCon Italia 2015",
    "copyright_text": "",
    "description": "In molti sistemi fisici, è importante riuscire ad individuare degli eventi analizzando una sequenza di immagini. Un esempio tra i tanti è quello di analizzare la dinamica di magnetizzazione un film sottile magnetico misurato con sistemi magneto-ottici. Le sequenze che si misurano contengono immagini solitamente molto rumorose dove è difficile riconoscere gli oggetti (nel nostro caso zone corrispondenti a inversione della magnetizzazione) perché i loro contorni non sono ben definiti. Non valgono quindi le tecniche standard per il riconoscimento dei bordi, come la edge detection etc.\nIn questo talk si propone una tecnica alternativa molto semplice ma potente che consiste nell’analizzare la sequenza del colore (o della scala di grigi) di un singolo pixel per poi ricostruire la dinamica dell’intera sequenza. Questo metodo è anche un istruttivo esempio dell’uso del calcolo parallelo. \nNon sono necessari particolare prerequisiti per la comprensione del talk.\n",
    "duration": 2259,
    "embed": "",
    "id": 3601,
    "language": "Italian",
    "quality_notes": "",
    "recorded": "2015-05-29",
    "related_urls": [],
    "slug": "riconoscimento-di-eventi-in-sequenze-di-immagini",
    "source_url": "https://www.youtube.com/watch?v=gRYklEeybWo",
    "speakers": [
        "Gianfranco Durin"
    ],
    "state": 1,
    "summary": "",
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/gRYklEeybWo/maxresdefault.jpg",
    "title": "Riconoscimento di eventi in sequenze di immagini molto rumorose",
    "updated": "2015-06-14T17:04:24.606",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": null,
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": ""
}