{
    "added": "2015-06-14T17:02:20.912",
    "category": "PyCon Italia 2015",
    "copyright_text": "",
    "description": "Heartbleed, Shellshock, POODLE, GHOST… With severe security vulnerabilities on the rise, how can developers protect the systems used to deploy their applications? Unattended package upgrades can help, but only if they are properly set up and monitored. Some of the challenges include:\r\n\r\n* many popular virtual private server (VPS) providers do not install or enable automatic security updates in their OS images\r\n* “unattended-upgrades” on Debian-based systems installs automatic security updates but does not actually enable them, potentially putting unsuspecting users at risk\r\n* some security updates (e.g., kernel-level) require a server reboot to take effect, and yet users often don’t realize this until the next time they log in, resulting in a system that is vulnerable in the interim\r\n",
    "duration": 2488,
    "embed": "",
    "id": 3567,
    "language": "English",
    "quality_notes": "",
    "recorded": "2015-06-09",
    "related_urls": [],
    "slug": "devops-security-protect-your-application-from-b",
    "source_url": "https://www.youtube.com/watch?v=Vqs5opW8CAY",
    "speakers": [
        "Justin Mayer"
    ],
    "state": 1,
    "summary": "In addition to outlining strategies for proper configuration of unattended security updates, this talk briefly covers how to maintain the security of Docker container environments, where the above strategies generally do not apply. In such environments, an entirely different approach and workflow is usually required.",
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/Vqs5opW8CAY/maxresdefault.jpg",
    "title": "DevOps Security — Protect Your Application From Being Owned",
    "updated": "2015-06-14T17:26:23.285",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}