{
    "added": "2013-07-04T10:08:33",
    "category": "SciPy 2013",
    "copyright_text": "http://www.youtube.com/t/terms",
    "description": "",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/iqE3JcHR6VQ?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/iqE3JcHR6VQ?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 1977,
    "language": "English",
    "quality_notes": "",
    "recorded": "2013-07-02",
    "related_urls": [],
    "slug": "neurotrends-large-scale-automated-analysis-of-th",
    "source_url": "http://www.youtube.com/watch?v=iqE3JcHR6VQ",
    "speakers": [],
    "state": 1,
    "status": "published",
    "summary": "Authors: Carp, Joshua, University of Michigan\n\nTrack: Medical Imaging\n\nHow do researchers design and analyze experiments? How should they? And how likely are their results to be reproducible? To investigate these questions, we developed NeuroTrends, a platform for large-scale analysis of research methods in the neuroimaging literature. Neurotrends identifies relevant research reports using the PubMed API, downloads and parses full-text HTML and PDF documents, and extracts hundreds of methodological details from this unstructured text.\n\nIn the present study, NeuroTrends was evaluated using a corpus of over 16,000 journal articles. Automatically extracted methodological meta-data were validated against a hand-coded database. Overall, methodological details were extracted accurately, with a mean d-prime value of 3.53 (range: 1.12 to 6.18). Results revealed both variability and stability in methodological practices over time, with some methods increasing in prevalence, some decreasing, and others remaining consistent. Results also showed that design and analysis pipelines were highly variable across studies and have grown more variable over time.\n\nIn sum, the present study confirms the feasibility of accurately extracting methodological meta-data from unstructured text. We also contend that variability in research methods across time and from study to study poses a challenge to reproducibility in the neuroimaging literature--and likely in many other fields as well. Future directions include improving the accuracy and coverage of the NeuroTrends platform, integrating with additional databases, and extending to research domains beyond neuroimaging.",
    "tags": [
        "Tech"
    ],
    "thumbnail_url": "http://i1.ytimg.com/vi/iqE3JcHR6VQ/hqdefault.jpg",
    "title": "NeuroTrends: Large-scale automated analysis of the neuroimaging literature; SciPy 2013 Presentation",
    "updated": "2014-04-08T20:28:26.354",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": null,
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": "needs editing"
}