{"tags": ["Tech"], "thumbnail_url": "http://i1.ytimg.com/vi/iH6fDRPLCYk/hqdefault.jpg", "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/iH6fDRPLCYk?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/iH6fDRPLCYk?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>", "added": "2013-07-04T10:08:48", "whiteboard": "needs editing", "video_flv_length": null, "title": "SCI-WMS: A Python Based Web Map Service For Met-Ocean Data; SciPy 2013 Presentation", "duration": null, "description": "", "state": 1, "category": "SciPy 2013", "video_mp4_download_only": false, "video_flv_download_only": false, "video_mp4_url": null, "video_webm_length": null, "video_mp4_length": null, "recorded": "2013-07-01", "copyright_text": "http://www.youtube.com/t/terms", "source_url": "http://www.youtube.com/watch?v=iH6fDRPLCYk", "video_webm_url": null, "summary": "SCI-WMS: A Python Based Web Map Service For Met-Ocean Data Accessible Over OpenDAP Or As NetCDF\n\nAuthors: Crosby, Alexander\n\nTrack: GIS - Geospatial Data Analysis\n\nSCI-WMS is a Python based web map service (WMS) designed as a web service for visualization of local or remote data such that they can be overlaid in georeferenced mapping environments like web maps or geographic information systems (GIS). The service follows the Open Geospatial Consortium (OGC) WMS specifications and is focused on the visualization of gridded data and unstructured meshes commonly stored in NetCDF files or available from distributed servers over the OpenDAP protocol. WMS servers are commonly used to visualize large archives of numerically modeled and observed data, and SCI-WMS is currently used in several U.S. Integrated Ocean Observing System (IOOS) projects around the country including the IOOS Super-regional Modeling Testbed and regional data portals. SCI-WMS was originally developed to fill a need for standards based visualization and data access tools to examine differences between unstructured mesh ocean models like FVCOM and ADCIRC, and the available visualization styles attempt to preserve as much of the complex topology as possible in the unstructured meshes. Support for regularly gridded datasets expanded the applicability of SCI-WMS for use with more commonly available ocean and meteorological model output as well as satellite derived observations.", "video_ogv_url": null, "video_ogv_length": null, "updated": "2014-04-08T20:28:26.441", "id": 2072, "related_urls": [], "slug": "sci-wms-a-python-based-web-map-service-for-met-o-1", "quality_notes": "", "video_webm_download_only": false, "video_flv_url": null, "language": "English", "video_ogv_download_only": false, "speakers": []}