{
    "added": "2013-07-04T10:08:37",
    "category": "SciPy 2013",
    "copyright_text": "http://www.youtube.com/t/terms",
    "description": "",
    "duration": null,
    "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/57hqE4m6Us0?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/57hqE4m6Us0?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>",
    "id": 2003,
    "language": "English",
    "quality_notes": "",
    "recorded": "2013-07-01",
    "related_urls": [],
    "slug": "scientific-computing-and-the-materials-genome-ini-",
    "source_url": "http://www.youtube.com/watch?v=57hqE4m6Us0",
    "speakers": [],
    "state": 1,
    "status": "published",
    "summary": "Authors: Reid, Andrew, National Institute of Standards and Technology\n\nTrack: General\n\nIt is a commonplace notion that, as computers continue to become more powerful and more widely available, the communities surrounding various computational tools and techniques gain the ability to tackle larger and more interesting problems.\n\nThe US government's Materials Genome Initiative for Global Competitiveness (MGI), announced in June of 2011, has the goal of reducing the time to discover, develop, manufacture, and deploy advanced materials by a factor of two, while reducing the associated costs. Among the approaches foreseen in the initiative, there are two that are of particular interest to computational science. These are, firstly, more sophisticated computational models of materials systems, and secondly, data management tools that will better organize materials data, making data more easily discoverable, providing validation and provenance information, and simplifying the incorporation of data into new models.\n\nThe scientific python community has long had its eye not only on the computational solution of scientific and engineering problems, but also on the related issues surrounding the management of large volumes of data, version control for codes, and management of the computational scientific workflow, including reproducibility. This community is well positioned to address MGI-related issues. This talk will describe how MGI goals are being translated into more specific computational problems at NIST and other institutions, and will describe some of the challenges and issues that we have already seen in working towards its goals. The role of the Python language in general, and scientific Python tools in particular, will be highlighted. In addition, the talk will describe areas of overlap and opportunities for contributions between the MGI and the scientific python community.",
    "tags": [
        "Tech"
    ],
    "thumbnail_url": "http://i1.ytimg.com/vi/57hqE4m6Us0/hqdefault.jpg",
    "title": "Scientific Computing and the Materials Genome Initiative; SciPy 2013 Presentation",
    "updated": "2014-04-08T20:28:26.433",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": null,
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": "needs editing"
}