{"tags": ["Tech"], "thumbnail_url": "http://i1.ytimg.com/vi/ei_pFi2xOUc/hqdefault.jpg", "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/ei_pFi2xOUc?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/ei_pFi2xOUc?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>", "added": "2013-07-04T10:08:40", "whiteboard": "needs editing", "video_flv_length": null, "title": "Exploring Collaborative HPC Visualization Workflows using VisIt and Python; SciPy 2013 Presentation", "duration": null, "description": "", "state": 1, "category": "SciPy 2013", "video_mp4_download_only": false, "video_flv_download_only": false, "video_mp4_url": null, "video_webm_length": null, "video_mp4_length": null, "recorded": "2013-07-02", "copyright_text": "http://www.youtube.com/t/terms", "source_url": "http://www.youtube.com/watch?v=ei_pFi2xOUc", "video_webm_url": null, "summary": "Authors: Krishnan, Harinarayan, Lawrence Berkeley National Labs; Harrison, Cyrus, Lawrence Livermore National\n\nTrack: Reproducible Science\n\nAs High Performance Computing (HPC) environments expand to address the larger computational needs of massive simulations and specialized data analysis and visualization routines, the complexity of these environments brings many challenges for scientists hoping to capture and publish their work in a reproducible manner. Collaboration using HPC resources is a particularly difficult aspect of the research process to capture. This is also the case for HPC visualization, even though there has been an explosion of technologies and tools for sharing in other contexts.\n\nPractitioners aiming for reproducibility would benefit from collaboration tools in this space that support the ability to automatically capture multi-user collaborative interactions. For this work, we modified VisIt, an open source scientific visualization platform, to provide an environment aimed at addressing these shortcomings. The talk will focus on two exploratory features added to VisIt:\n\n1) We enhanced VisIt's infrastructure expose a JSON API to clients over WebSockets. The new JSON API enables VisIt clients on web-based and mobile platforms. This API also enables multi-user collaborative visualization sessions. These collaborative visualization sessions can record annotated user interactions to Python scripts that can be replayed to reproduce the session in the future, thus capturing not only the end product but the step-by-step process used to create the visualization.\n\n2) We have also added support for new Python & R programmable pipelines which allow users to easily execute their analysis scripts within VisIt's parallel infrastructure. The goal of this new functionality is to provide users familiar with of Python and R with an easier path to embed their analysis within VisIt.\n\nTo showcase how these new features enable reproducible science, we will present a workflow that demonstrates a Climate Science use case.", "video_ogv_url": null, "video_ogv_length": null, "updated": "2014-04-08T20:28:26.345", "id": 2027, "related_urls": [], "slug": "exploring-collaborative-hpc-visualization-workflo", "quality_notes": "", "video_webm_download_only": false, "video_flv_url": null, "language": "English", "video_ogv_download_only": false, "speakers": []}