{"tags": ["Tech"], "thumbnail_url": "http://i1.ytimg.com/vi/1u1ttwfTgrQ/hqdefault.jpg", "embed": "<object width=\"640\" height=\"390\"><param name=\"movie\" value=\"http://youtube.com/v/1u1ttwfTgrQ?version=3&amp;hl=en_US\"></param><param name=\"allowFullScreen\" value=\"true\"></param><param name=\"allowscriptaccess\" value=\"always\"></param><embed src=\"http://youtube.com/v/1u1ttwfTgrQ?version=3&amp;hl=en_US\" type=\"application/x-shockwave-flash\" width=\"640\" height=\"390\" allowscriptaccess=\"always\" allowfullscreen=\"true\"></embed></object>", "added": "2013-07-04T10:08:34", "whiteboard": "needs editing", "video_flv_length": null, "title": "Massive Online Collaborative Research and Modeling using Synapse and Python; SciPy 2013 Presentation", "duration": null, "description": "", "state": 1, "category": "SciPy 2013", "video_mp4_download_only": false, "video_flv_download_only": false, "video_mp4_url": null, "video_webm_length": null, "video_mp4_length": null, "recorded": "2013-07-02", "copyright_text": "http://www.youtube.com/t/terms", "source_url": "http://www.youtube.com/watch?v=1u1ttwfTgrQ", "video_webm_url": null, "summary": "Authors: Omberg, Larsson, Sage Bionetworks\n\nTrack: Bioinformatics\n\nSynapse is an open source software as a service (SaaS) platform built by Sage Bionetworks to enable collaborative and reproducible science. Having RESTful APIs at its base, Synapse is able to easily link to analytical software such as Python. In this talk I will present the Python bindings to this platform and, more specifically, how it fostered a collaborative environment for over 140 individual researchers spread across 25 institutions in The Cancer Genome Atlas (TCGA) consortium. Synapse enables tracking of provenance of data from individual genome sequencing centers, processing and quality control, and all the way through results generated from models of cancer genomics. Synapse is designed as an information commons. Allowing any user not only to access data but also contribute results and models. This allows the TCGA collaboration to accelerate discovery by using partial contributed results as starting points for downstream analyses. One sub-project that has emerged from the collaboration is an online machine learning competition to predict expected survival time of cancer patients given molecular phenotype. All submitted models are immediately open sourced allowing derivative models to be built. These collaborative competitions provide an alternative approach to performing computational science which tools like Python and Synapse can greatly accelerate.", "video_ogv_url": null, "video_ogv_length": null, "updated": "2014-04-08T20:28:26.350", "id": 1981, "related_urls": [], "slug": "massive-online-collaborative-research-and-modelin", "quality_notes": "", "video_webm_download_only": false, "video_flv_url": null, "language": "English", "video_ogv_download_only": false, "speakers": []}