{
    "added": "2015-08-10T15:47:59.243",
    "category": "PyGotham 2015",
    "copyright_text": "CC BY-SA",
    "description": "In this talk, I discuss my work using Python to create a system for sarcasm detection in speech.  My goal in this task is to determine whether human intonation alone can be modeled to predict sarcastic speech.  I first extracted speech samples from the titular character of MTV’s late ‘90s hit TV show “Daria”.  Using crowdsourcing techniques to get the speech labeled for sarcasm, I created a corpus of speech that is annotated for sarcasm and sincerity.  I used several Python toolkits to extract a number of acoustic features from this speech that are indicative of sarcasm.  The first tool I used was Snack Sound Toolkit, a library for Python that does basic sound handling and analysis.  I used tools in Snack to extract a baseline of basic acoustic features that have been found to be helpful in human sarcasm identification.  I then used NumPy, SciPy, and NLTK to model prosodic contours, and applied these contours to the task of automatic sarcasm detection.  This approach applies sequential modeling to representations of pitch and intensity curves obtained via k-means clustering.  Using machine learning (specifically Weka’s SimpleLogistic (LogitBoost) classifier), this system is able to predict sarcasm with 81.57% accuracy.  ",
    "duration": 1403,
    "embed": "",
    "id": 3773,
    "language": "English",
    "quality_notes": "",
    "recorded": "2015-08-16",
    "related_urls": [],
    "slug": "using-python-for-sarcasm-detection-in-speech",
    "source_url": "http://youtu.be/xJlTDy61L8s",
    "speakers": [
        "Rachel Rakov"
    ],
    "state": 1,
    "status": "published",
    "summary": "",
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/xJlTDy61L8s/hqdefault.jpg",
    "title": "Using Python for Sarcasm Detection in Speech",
    "updated": "2015-08-18T13:48:15.411",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "http://64966d3674e0a64d8f4a-47c94b14ef8e1f83d5390cdb0629c6ed.r53.cf2.rackcdn.com/pygotham-2015/3773_Using_Python_for_Sarcasm_Detection_in_Speech.mp4",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": ""
}