{
    "added": "2012-02-23T04:20:00",
    "category": "PyTexas 2011",
    "copyright_text": "",
    "description": "Being non-relational, Cassandra's data model is fundamentally different from\nthat of a relational database. In addition, it uses an RPC based API rather\nthan a query language. On top of that, Cassandra is a distributed database, so\nthe client must be aware of and interact with multiple nodes in the cluster.\nAll of these attributes of Cassandra make the client libraries a different\nexperience. Fortunately, the Python client library is the easiest way to use\nCassandra. This talk will start with a high level overview of the clustering\nmodel of Cassandra then its data model. A large portion of the talk will cover\nthe pycassa methods that interact with the data model of Cassandra, i.e.\ninserting, fetching, and removing data. A small amount of time will be\ndedicated to describing connection pooling in pycassa -- how it handles node\nfailures, distributes requests, etc. The final 10 minutes will be devoted to\nQ&A.\n\n",
    "duration": null,
    "embed": "",
    "id": 556,
    "language": "English",
    "quality_notes": "",
    "recorded": null,
    "related_urls": [],
    "slug": "cassandra-for-python-developers",
    "source_url": "",
    "speakers": [
        "Tyler Hobbs"
    ],
    "state": 1,
    "summary": "Apache Cassandra is an open source, distributed (NoSQL) database. This will\ngive a high level introduction to Cassandra and its data model; it will detail\nthe features of pycassa, the Python client library for Cassandra, and how to\ninteract with Cassandra through it.\n\n",
    "tags": [
        "fetching"
    ],
    "thumbnail_url": "http://a.images.blip.tv/Nextdayvideo-CassandraForPythonDevelopers227-199.jpg",
    "title": "Cassandra for Python Developers",
    "updated": "2014-04-08T20:28:25.406",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": null,
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "http://05d2db1380b6504cc981-8cbed8cf7e3a131cd8f1c3e383d10041.r93.cf2.rackcdn.com/pytexas-2011/556_cassandra-for-python-developers.m4v",
    "video_ogv_download_only": false,
    "video_ogv_length": 204236510,
    "video_ogv_url": null,
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": null,
    "whiteboard": ""
}