{
    "added": "2014-10-26T18:22:37.940",
    "category": "PyGotham 2014",
    "copyright_text": "youtube",
    "description": "Twitter depends heavily on real-time event aggregation. Classic timeseries applications include site traffic, service health, and user engagement monitoring; these are increasingly complemented by a range of products and features that surface aggregated timeseries data directly to end users. Services that power such features need to be resilient enough to ensure a consistent user experience, flexible enough to accommodate a rapidly changing product roadmap, and able to scale to tens of billions of events per day.\r\n\r\nExperience has shown that truly robust real-time aggregation services are hard to build; scaling and evolving them gracefully is even harder; and, moreover, many timeseries applications call for essentially the same architecture, with slight variations in the data model. Solving this broad class of problems at Twitter has been a multiyear effort. In previous talks we have introduced Summingbird, a high-level abstraction library for generalized distributed computation, which provides an elegant descriptive framework for complex aggregation problems. In this talk, I will describe how we built a flexible, reusable, end-to-end service architecture on top of Summingbird, called TSAR (the TimeSeries AggregatoR).\r\n\r\nTSAR uses Python to provide an service toolkit that integrates with essential services that provide data processing, data warehousing, query capability, observability, and alerting, automatically configuring and orchestrating its components.",
    "duration": null,
    "embed": "<iframe type='text/html' src='http://www.youtube.com/embed/XzHokP3NZu4' width='640' height='360' frameborder='0' allowfullscreen='true'/>",
    "id": 3307,
    "language": "English",
    "quality_notes": "",
    "recorded": "2014-09-17",
    "related_urls": [],
    "slug": "tsar-the-timeseries-aggregator",
    "source_url": "https://www.youtube.com/watch?v=XzHokP3NZu4",
    "speakers": [
        "Anirudh Todi"
    ],
    "state": 1,
    "status": "published",
    "summary": "",
    "tags": [],
    "thumbnail_url": "https://i.ytimg.com/vi/XzHokP3NZu4/hqdefault.jpg",
    "title": "TSAR (the TimeSeries AggregatoR)",
    "updated": "2014-10-26T18:22:37.940",
    "video_flv_download_only": false,
    "video_flv_length": null,
    "video_flv_url": "",
    "video_mp4_download_only": false,
    "video_mp4_length": null,
    "video_mp4_url": "",
    "video_ogv_download_only": false,
    "video_ogv_length": null,
    "video_ogv_url": "",
    "video_webm_download_only": false,
    "video_webm_length": null,
    "video_webm_url": "",
    "whiteboard": ""
}